daqinxiaren/companyProgramCode/clb_app/rtos/bsp/stm32/drivers/drv_spi.c
    OS_ASSERT(result == OS_EOK);

    LOG_D("%s attach to %s done", device_name, bus_name);

    return result;
}

#if defined(BSP_SPI1_TX_ENABLE_DMA) || defined(BSP_SPI1_RX_ENABLE_DMA)
void SPI1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_SPI_IRQHandler(&spi_bus_obj[SPI1_INDEX].handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI1) && defined(BSP_SPI1_RX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI1_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI1_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI1) && defined(BSP_SPI1_TX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI1_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI1_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(ENABLE_SPI1) && defined(BSP_SPI_ENABLE_DMA) */

#if defined(BSP_SPI2_TX_ENABLE_DMA) || defined(BSP_SPI2_RX_ENABLE_DMA)
void SPI2_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_SPI_IRQHandler(&spi_bus_obj[SPI2_INDEX].handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI2) && defined(BSP_SPI2_RX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI2_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI2_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI2) && defined(BSP_SPI2_TX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI2_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI2_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(ENABLE_SPI2) && defined(BSP_SPI_ENABLE_DMA) */

#if defined(BSP_SPI3_TX_ENABLE_DMA) || defined(BSP_SPI3_RX_ENABLE_DMA)
void SPI3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_SPI_IRQHandler(&spi_bus_obj[SPI3_INDEX].handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI3) && defined(BSP_SPI3_RX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI3_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI3_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI3) && defined(BSP_SPI3_TX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI3_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI3_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(ENABLE_SPI3) && defined(BSP_SPI_ENABLE_DMA) */

#if defined(BSP_SPI4_TX_ENABLE_DMA) || defined(BSP_SPI4_RX_ENABLE_DMA)
void SPI4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_SPI_IRQHandler(&spi_bus_obj[SPI4_INDEX].handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI4) && defined(BSP_SPI4_RX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI4_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI4_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI4) && defined(BSP_SPI4_TX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI4_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI4_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(ENABLE_SPI4) && defined(BSP_SPI_ENABLE_DMA) */

#if defined(BSP_SPI5_TX_ENABLE_DMA) || defined(BSP_SPI5_RX_ENABLE_DMA)
void SPI5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_SPI_IRQHandler(&spi_bus_obj[SPI5_INDEX].handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI5) && defined(BSP_SPI5_RX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI5_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI5_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI5) && defined(BSP_SPI5_TX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI5_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI5_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(ENABLE_SPI5) && defined(BSP_SPI_ENABLE_DMA) */

#if defined(ENABLE_SPI6) && defined(BSP_SPI6_RX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI6_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI6_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif

#if defined(ENABLE_SPI6) && defined(BSP_SPI6_TX_ENABLE_DMA)
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI6_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI6_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(ENABLE_SPI6) && defined(BSP_SPI_ENABLE_DMA) */

static void stm32_get_dma_info(void)
{
#ifdef BSP_SPI1_RX_ENABLE_DMA
    spi_bus_obj[SPI1_INDEX].spi_dma_flag |= SPI_ENABLE_RX_DMA_FLAG;
    static struct dma_config spi1_dma_rx = SPI1_RX_DMA_CONFIG;
    spi_config[SPI1_INDEX].dma_rx = &spi1_dma_rx;
#endif
#ifdef BSP_SPI1_TX_ENABLE_DMA
    spi_bus_obj[SPI1_INDEX].spi_dma_flag |= SPI_ENABLE_TX_DMA_FLAG;
    static struct dma_config spi1_dma_tx = SPI1_TX_DMA_CONFIG;
    spi_config[SPI1_INDEX].dma_tx = &spi1_dma_tx;
#endif

#ifdef BSP_SPI2_RX_ENABLE_DMA
    spi_bus_obj[SPI2_INDEX].spi_dma_flag |= SPI_ENABLE_RX_DMA_FLAG;
    static struct dma_config spi2_dma_rx = SPI2_RX_DMA_CONFIG;
    spi_config[SPI2_INDEX].dma_rx = &spi2_dma_rx;
#endif
#ifdef BSP_SPI2_TX_ENABLE_DMA
    spi_bus_obj[SPI2_INDEX].spi_dma_flag |= SPI_ENABLE_TX_DMA_FLAG;
    static struct dma_config spi2_dma_tx = SPI2_TX_DMA_CONFIG;
    spi_config[SPI2_INDEX].dma_tx = &spi2_dma_tx;
#endif

#ifdef BSP_SPI3_RX_ENABLE_DMA
    spi_bus_obj[SPI3_INDEX].spi_dma_flag |= SPI_ENABLE_RX_DMA_FLAG;
    static struct dma_config spi3_dma_rx = SPI3_RX_DMA_CONFIG;
    spi_config[SPI3_INDEX].dma_rx = &spi3_dma_rx;
#endif
#ifdef BSP_SPI3_TX_ENABLE_DMA
    spi_bus_obj[SPI3_INDEX].spi_dma_flag |= SPI_ENABLE_TX_DMA_FLAG;
    static struct dma_config spi3_dma_tx = SPI3_TX_DMA_CONFIG;
    spi_config[SPI3_INDEX].dma_tx = &spi3_dma_tx;
#endif

#ifdef BSP_SPI4_RX_ENABLE_DMA
    spi_bus_obj[SPI4_INDEX].spi_dma_flag |= SPI_ENABLE_RX_DMA_FLAG;
    static struct dma_config spi4_dma_rx = SPI4_RX_DMA_CONFIG;
    spi_config[SPI4_INDEX].dma_rx = &spi4_dma_rx;
#endif
#ifdef BSP_SPI4_TX_ENABLE_DMA
    spi_bus_obj[SPI4_INDEX].spi_dma_flag |= SPI_ENABLE_TX_DMA_FLAG;
    static struct dma_config spi4_dma_tx = SPI4_TX_DMA_CONFIG;
    spi_config[SPI4_INDEX].dma_tx = &spi4_dma_tx;
#endif

#ifdef BSP_SPI5_RX_ENABLE_DMA
    spi_bus_obj[SPI5_INDEX].spi_dma_flag |= SPI_ENABLE_RX_DMA_FLAG;
    static struct dma_config spi5_dma_rx = SPI5_RX_DMA_CONFIG;
    spi_config[SPI5_INDEX].dma_rx = &spi5_dma_rx;
#endif
#ifdef BSP_SPI5_TX_ENABLE_DMA
    spi_bus_obj[SPI5_INDEX].spi_dma_flag |= SPI_ENABLE_TX_DMA_FLAG;
    static struct dma_config spi5_dma_tx = SPI5_TX_DMA_CONFIG;
    spi_config[SPI5_INDEX].dma_tx = &spi5_dma_tx;
#endif

#ifdef BSP_SPI6_RX_ENABLE_DMA
    spi_bus_obj[SPI6_INDEX].spi_dma_flag |= SPI_ENABLE_RX_DMA_FLAG;
    static struct dma_config spi6_dma_rx = SPI6_RX_DMA_CONFIG;
    spi_config[SPI6_INDEX].dma_rx = &spi6_dma_rx;
#endif
#ifdef BSP_SPI6_TX_ENABLE_DMA
    spi_bus_obj[SPI6_INDEX].spi_dma_flag |= SPI_ENABLE_TX_DMA_FLAG;
    static struct dma_config spi6_dma_tx = SPI6_TX_DMA_CONFIG;
    spi_config[SPI6_INDEX].dma_tx = &spi6_dma_tx;
#endif
}

#if defined(STM32F0XX)
void SPI1_DMA_RX_TX_IRQHandler(void) 
{
#if defined(ENABLE_SPI1) && defined(BSP_SPI1_TX_ENABLE_DMA)
    SPI1_DMA_TX_IRQHandler();
#endif
    
#if defined(ENABLE_SPI1) && defined(BSP_SPI1_RX_ENABLE_DMA)
    SPI1_DMA_RX_IRQHandler();
#endif
}

void SPI2_DMA_RX_TX_IRQHandler(void) 
{
#if defined(ENABLE_SPI2) && defined(BSP_SPI2_TX_ENABLE_DMA)
    SPI2_DMA_TX_IRQHandler();
#endif
    
#if defined(ENABLE_SPI2) && defined(BSP_SPI2_RX_ENABLE_DMA)
    SPI2_DMA_RX_IRQHandler();
#endif
}
#endif  /* STM32F0XX */

int rt_hw_spi_init(void)
{
    stm32_get_dma_info();
    return rt_hw_spi_bus_init();
}
INIT_BOARD_EXPORT(rt_hw_spi_init);

#endif /* ENABLE_SPI1 || ENABLE_SPI2 || ENABLE_SPI3 || ENABLE_SPI4 || ENABLE_SPI5 */
#endif /* ENABLE_SPI */
